In [1]:
import pandas as pd
import numpy as np

np.random.seed(30)
numerosAleatorios = np.random.rand(25).reshape((5,5))


#linhas = ['linha 1', 'linha 2', 'linha 3', 'linha 4', 'linha 5'] Se eu não indexar linhas, ele colocará sozinho
colunas = ['col 1', 'col 2', 'col 3', 'col 4', 'col 5']

df = pd.DataFrame(numerosAleatorios, columns=colunas) #Eu poderia colocar o index=linhas.

df

      col 1     col 2     col 3     col 4     col 5
0  0.644144  0.380748  0.663048  0.163651  0.962608
1  0.346662  0.991751  0.235058  0.585694  0.406690
2  0.136234  0.544136  0.518176  0.766855  0.933850
3  0.089703  0.195771  0.994194  0.235180  0.238986
4  0.629100  0.734953  0.688344  0.031131  0.902514

É importante colocar filtros para seleção de dados

In [2]:
df < .3

   col 1  col 2  col 3  col 4  col 5
0  False  False  False   True  False
1  False  False   True  False  False
2   True  False  False  False  False
3   True   True  False   True   True
4  False  False  False   True  False

In [3]:
df['col 1'] # Pegando todas as linhas da coluna 1

0    0.644144
1    0.346662
2    0.136234
3    0.089703
4    0.629100
Name: col 1, dtype: float64

In [4]:
df['col 1'][0] #Puxando uma linha específica

0.644143536068335

# Aplicando um filtro

In [5]:
filtro = df < .3 #Aqui é só para testes
df[filtro]

      col 1     col 2     col 3     col 4     col 5
0       NaN       NaN       NaN  0.163651       NaN
1       NaN       NaN  0.235058       NaN       NaN
2  0.136234       NaN       NaN       NaN       NaN
3  0.089703  0.195771       NaN  0.235180  0.238986
4       NaN       NaN       NaN  0.031131       NaN

In [6]:
dadoNulo = np.nan #Colocando todos os dados NaN dentro dessa variável
serie = pd.Series(['a', 'b', dadoNulo, 'c', dadoNulo])
serie

0      a
1      b
2    NaN
3      c
4    NaN
dtype: object

In [111]:
serie.isnull #Verificação da existencia de valores nulos

<bound method Series.isnull of 0      a
1      b
2    NaN
3      c
4    NaN
dtype: object>

In [112]:
serie.fillna('Brasil')

0         a
1         b
2    Brasil
3         c
4    Brasil
dtype: object

In [113]:
#Alterando toda a linha como NaN
df.loc[0] = dadoNulo
df

      col 1     col 2     col 3     col 4     col 5
0       NaN       NaN       NaN       NaN       NaN
1  0.346662  0.991751  0.235058  0.585694  0.406690
2  0.136234  0.544136  0.518176  0.766855  0.933850
3  0.089703  0.195771  0.994194  0.235180  0.238986
4  0.629100  0.734953  0.688344  0.031131  0.902514

In [114]:
tabelaSemNaN = df.fillna(0.9)
tabelaSemNaN

      col 1     col 2     col 3     col 4     col 5
0  0.900000  0.900000  0.900000  0.900000  0.900000
1  0.346662  0.991751  0.235058  0.585694  0.406690
2  0.136234  0.544136  0.518176  0.766855  0.933850
3  0.089703  0.195771  0.994194  0.235180  0.238986
4  0.629100  0.734953  0.688344  0.031131  0.902514

In [115]:
#Somando quantos dados nulos há no data frame
serie.isnull().sum()

2

In [116]:
df.dropna(axis=1) #ELe eliminou tudo pq todas as linhas possuem NaN pelo menos uma vez

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

# EXERCÍCIOS

1. Crie um DataFrame baseado na tabela abaixo;
2. Substitua o valor NaN contido na coluna Java pela médoa das notas de Java. Faça o mesmo na coluna Banco de Dados;
3. Imprimir o boletim dos alunos com nota em Python acima da média

In [5]:
alunos = ['Thyago', 'Theo', 'Sophia']
disciplinas = ['Python', 'Java', 'Banco de Dados']


branco = np.nan #Eu poderia colocar o np.nan dentro da linha que eu quero em branco

#Array pode ser unidimensional ou bidimensional. Ele pode ser uma matriz
notas = np.array([8.0, 7.0, branco, 9.0, 7.5, 10.0, 7.0, branco, 8.0])#Transformando em uma lista numpy. 
notas = notas.reshape(3,3)  #O reshape é uma função do array que pertence ao Numpy

tabela = pd.DataFrame(notas, index=alunos, columns=disciplinas)
tabela

        Python  Java  Banco de Dados
Thyago     8.0   7.0             NaN
Theo       9.0   7.5            10.0
Sophia     7.0   NaN             8.0

In [6]:
#Manipulo só a coluna para tirar a média e substituir os valores nulos. #Criando uma série com a coluna Java

java = tabela['Java'] #Não se usa loc para colunas
java

Thyago    7.0
Theo      7.5
Sophia    NaN
Name: Java, dtype: float64

In [7]:
java = tabela['Java'] #Escolhendo a coluna
java['Thyago']        #Escolhendo a linha

7.0

In [8]:
java = tabela['Java'] 
java['Sophia'] = java.mean() #Tirando a média
java

Thyago    7.00
Theo      7.50
Sophia    7.25
Name: Java, dtype: float64

In [9]:
#Ou

print(tabela)

        Python  Java  Banco de Dados
Thyago     8.0  7.00             NaN
Theo       9.0  7.50            10.0
Sophia     7.0  7.25             8.0

In [10]:
bancoDeDados = tabela['Banco de Dados']
bancoDeDados['Thyago'] = bancoDeDados.mean()
bancoDeDados

Thyago     9.0
Theo      10.0
Sophia     8.0
Name: Banco de Dados, dtype: float64

In [11]:
tabela

        Python  Java  Banco de Dados
Thyago     8.0  7.00             9.0
Theo       9.0  7.50            10.0
Sophia     7.0  7.25             8.0

In [12]:
tabela

        Python  Java  Banco de Dados
Thyago     8.0  7.00             9.0
Theo       9.0  7.50            10.0
Sophia     7.0  7.25             8.0

Resolvendo o segundo exercício

In [23]:
python = tabela['Python']
filtro = python > 7
filtro

Thyago     True
Theo       True
Sophia    False
Name: Python, dtype: bool

In [16]:
print(tabela[filtro]) #Para imprimir os dados sem ser Bool

        Python  Java  Banco de Dados
Thyago     8.0   7.0             9.0
Theo       9.0   7.5            10.0

In [18]:
java = java.fillna(java.mean())
java

#Pegando essa série e encaixando novamente no data frame
tabela['Java'] = java
tabela

        Python  Java  Banco de Dados
Thyago     8.0  7.00             9.0
Theo       9.0  7.50            10.0
Sophia     7.0  7.25             8.0

In [20]:
#Pedaço do código de outro arquivo

banco = tabela['Banco de Dados']
banco = banco.fillna(banco.mean())
banco

Thyago     9.0
Theo      10.0
Sophia     8.0
Name: Banco de Dados, dtype: float64